app/Controllers/AuthController.php

    public function autenticar()
{
    $email    = $this->request->getPost('email');
    $password = $this->request->getPost('senha');
    $user     = $this->usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'teste@teste.com'
 LIMIT 1