app/Controllers/CategoriasController.php

    public function index()
    {
        $data['categorias'] = $this->categoriasModel->findAll();
---
SELECT *
FROM `categorias`