app/Controllers/DashboardController.php

    public function dashboard()
    {
        // Produtos pendentes
        $produtos   = $this->produtoModel->where('status', 'reprovado')->findAll();
        // Usuários
        $users      = $this->usuarioModel->findAll();
        // Categorias
        $categorias = $this->categoriaModel->findAll();
---
SELECT *
FROM `produtos`
WHERE `status` = 'reprovado'
SELECT *
FROM `usuarios`
SELECT *
FROM `categorias`