app/Controllers/FotoProdutoController.php

SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '1'
---
    public function index($produtoId){
        //busca as fotos relacionadas ao produto (pelo id do produto passado pela URL)
        $fotos = $this->fotoProdutoModel->ListarPorProduto($produtoId);

        //busca o produto pelo id
        $produtoModel = new produtoModel();
        $produto = $produtoModel->find($produtoId);