app/Controllers/LojaController.php

    public function finalizarCompra()
{
    $uid = session()->get('usuario_id');
    $this->logs[] = "[Loja] iniciar finalizarCompra para user: {$uid}";
    if (! $uid) {
        session()->setFlashdata('logs', $this->logs);
        return redirect()->to('/login')->with('error','Login requerido');
    }

    // Recebe forma e parcelas do POST
    $formaPagamento = $this->request->getPost('forma_pagamento');
    $parcelas       = (int) $this->request->getPost('parcelas');
    if ($formaPagamento === 'pix') {
        $parcelas = 1;
    }

    $itens = $this->carrinhoModel->where('usuario_id', $uid)->findAll();
    $this->logs[] = "[Loja] itens no carrinho: " . count($itens);
    if (empty($itens)) {
        session()->setFlashdata('logs', $this->logs);
        return redirect()->back()->with('error','Carrinho vazio');
    }

    $comprador = $this->usuarioModel->find($uid);
    $this->logs[] = "[Loja] comprador: {$comprador['email']}";
    $descricao = [];
    $total     = 0;

    foreach ($itens as $item) {
        $p   = $this->produtoModel->find($item['produto_id']);
---
SELECT *
FROM `carrinho`
WHERE `usuario_id` = '12'
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '9'

        $total += $sub;

        $this->logs[] = "[Loja] registrando venda compr={$uid}, vend={$p['usuario_id']}, prod={$p['id']}, val={$sub}";
        $this->vendaModel->insert([
            'usuario_comprador_id'=> $uid,
            'usuario_vendedor_id' => $p['usuario_id'],
            'produto_id'          => $p['id'],
            'quantidade'          => $item['quantidade'],
            'valor_total'         => $sub,
            'forma_pagamento'     => $formaPagamento,
            'parcelas'            => $parcelas,
            'criado_em'           => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `vendas` (`usuario_comprador_id`, `usuario_vendedor_id`, `produto_id`, `quantidade`, `valor_total`, `forma_pagamento`, `parcelas`, `criado_em`) VALUES ('12', '7', '9', '1', 30.9, 'cartao', 9, '2025-07-02 00:24:46')