app/Controllers/LojaController.php

     public function publico()
    {
        $categoriaModel = new \App\Models\CategoriasModel();

        $filtroNome   = $this->request->getGet('filtroNome');
        $filtroPreco  = $this->request->getGet('filtroPreco');
        $idCategoria  = $this->request->getGet('id_categoria');

        $query = $this->produtoModel->getComCategoriaECapa()
                    ->where('produtos.status', 'aprovado');

        if (! empty($filtroNome)) {
            $query->like('produtos.nome', $filtroNome);
        }
        if (! empty($filtroPreco)) {
            if ($filtroPreco === 'baixo') {
                $query->where('produtos.preco <', 100);
            } elseif ($filtroPreco === 'medio') {
                $query->where('produtos.preco >=', 100)
                      ->where('produtos.preco <=', 500);
            } else {
                $query->where('produtos.preco >', 500);
            }
        }
        if (! empty($idCategoria)) {
            $query->where('produtos.id_categoria', $idCategoria);
        }

        return view('publico/index', [
            'produtos'   => $query->paginate(8),
            'pager'      => $query->pager,
            'categorias' => $categoriaModel->findAll(),
            'filtroNome' => $filtroNome,
            'filtroPreco'=> $filtroPreco,
            'idCategoria'=> $idCategoria,
        ]);
---
SELECT *
FROM `categorias`
SELECT COUNT(*) AS `numrows`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`status` = 'aprovado'
SELECT `produtos`.*, `categorias`.`nome` as `nome_categoria`, `fotos_produtos`.`caminho` as `foto_capa`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`status` = 'aprovado'
ORDER BY `produtos`.`id` DESC
 LIMIT 8

    public function detalhes($id)
{
    $produto = $this->produtoModel
        ->select('produtos.*, usuarios.username as nome_vendedor')
        ->join('usuarios', 'usuarios.id = produtos.usuario_id', 'left')
        ->where('produtos.status', 'aprovado')
        ->find($id);

    if (! $produto) {
        return redirect()->to('/')->with('erro', 'Produto não encontrado ou não aprovado');
    }

    $fotos = $this->fotoModel->where('produto_id', $id)->findAll();
    $relacionados = $this->produtoModel
        ->getComCategoriaECapa()
        ->where('produtos.status', 'aprovado')
        ->where('produtos.id !=', $produto['id'])
        ->findAll();

    // <<< Aqui buscamos o vendedor e o enviamos à view
    $vendedor = $this->usuarioModel->find($produto['usuario_id']);
---
SELECT `produtos`.*, `usuarios`.`username` as `nome_vendedor`
FROM `produtos`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `produtos`.`usuario_id`
WHERE `produtos`.`status` = 'aprovado'
AND `produtos`.`id` = '9'
SELECT `produtos`.*, `usuarios`.`username` as `nome_vendedor`
FROM `produtos`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `produtos`.`usuario_id`
WHERE `produtos`.`id` = '14'
SELECT `produtos`.*, `categorias`.`nome` as `nome_categoria`, `fotos_produtos`.`caminho` as `foto_capa`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`id` != '6'
ORDER BY `produtos`.`id` DESC
SELECT `produtos`.*, `categorias`.`nome` as `nome_categoria`, `fotos_produtos`.`caminho` as `foto_capa`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`status` = 'aprovado'
AND `produtos`.`id` != '9'
ORDER BY `produtos`.`id` DESC
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '7'

    public function adicionarAoCarrinho($produtoId = null)
    {
        $usuarioId = session()->get('usuario_id');

        // Se não estiver logado, redireciona para login
        if (!$usuarioId) {
            return redirect()->to('/login')
                             ->with('error', 'Você precisa estar logado para adicionar produtos ao carrinho');
        }

        // Valida ID do produto
        if (!$produtoId) {
            return redirect()->back()->with('error', 'ID do produto não informado');
        }

        // Busca o produto
        $produto = $this->produtoModel->find($produtoId);
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '9'

        }

        // Decrementa estoque
        $this->produtoModel->update(
            $produtoId,
            ['estoque' => $produto['estoque'] - $quantidade]
        );

        // Insere no carrinho
        $this->carrinhoModel->insert([
            'usuario_id'      => $usuarioId,
            'produto_id'      => $produtoId,
            'quantidade'      => $quantidade,
            'adicionado_em'   => date('Y-m-d H:i:s'),
            'forma_pagamento' => $formaPagamento,
            'parcelas'        => $parcelas,
        ]);
---
UPDATE `produtos` SET `estoque` = 2, `updated_at` = '2025-06-29 17:16:20'
WHERE `produtos`.`id` IN ('9')
INSERT INTO `carrinho` (`usuario_id`, `produto_id`, `quantidade`, `adicionado_em`, `forma_pagamento`, `parcelas`) VALUES ('9', '9', 1, '2025-06-29 17:16:20', 'cartao', 2)

    public function carrinho()
    {
        $usuarioId = session()->get('usuario_id');
        if (! $usuarioId) {
            return redirect()->to('/login')
                             ->with('error', 'Você precisa estar logado para ver o carrinho.');
        }

        $itens = $this->carrinhoModel
                      ->where('usuario_id', $usuarioId)
                      ->findAll();

        foreach ($itens as &$item) {
            $produto         = $this->produtoModel->find($item['produto_id']);
---
SELECT *
FROM `carrinho`
WHERE `usuario_id` = '9'
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '9'


        // 3) Envia a cada VENDEDOR
        foreach ($itensPorVendedor as $vendedorId => $lista) {
            $v = $this->usuarioModel->find($vendedorId);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '12'

        }

        // 4) Limpa o carrinho
        $this->carrinhoModel
             ->where('usuario_id', $usuarioId)
             ->delete();
---
DELETE FROM `carrinho`
WHERE `usuario_id` = '12'