app/Controllers/ProdutoController.php

    public function index()
    {
        //recebe string de nome e preco do formulário
        $filtroNome = $this->request->getGet('filtroNome');
        $filtroPreco = $this->request->getGet('filtroPreco');

        $query = $this->produtoModel
        ->select('produtos.*, categorias.nome as nome_categoria')
        ->join('categorias', 'categorias.id = produtos.id_categoria', 'left');

        if(!empty($filtroNome)){
            $query->like('produtos.nome', $filtroNome);
        }


        if(!empty($filtroPreco)){
            if($filtroPreco=='baixo'){
                $query = $query->where(' preco < 100');
            }
            if($filtroPreco=='medio'){
                $query = $query->where('preco > 100')->where('preco < 500');
            }
            if($filtroPreco=='alto'){
                $query = $query->where('preco > 500');
            }


        }

        $data = [
            'produtos' => $query->paginate(10),
            'pager' => $query->pager,
            'busca' => $filtroNome,
            'preco' => $filtroPreco
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
SELECT `produtos`.*, `categorias`.`nome` as `nome_categoria`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
WHERE `produtos`.`nome` LIKE '%aaa%' ESCAPE '!'
 LIMIT 10

    public function create()
    {
        $data['categorias'] = $this->categoriaModel->findAll();
---
SELECT *
FROM `categorias`

    public function edit($id)
    {

        $data['produto'] = $this->produtoModel->find($id);
        $data['categorias'] = $this->categoriaModel->findAll();
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '122'
SELECT *
FROM `categorias`