app/Controllers/ProdutoController.php

    public function index()
    {
        $usuarioId = session()->get('usuario_id');
        $busca = $this->request->getGet('busca');
        $preco = $this->request->getGet('preco');

        $query = $this->produtoModel->getProdutosPorUsuarioComCategoriaECapa($usuarioId);

        if (!empty($busca)) {
            $query->like('produtos.nome', $busca);
        }

        if (!empty($preco)) {
            if ($preco === 'baixo') {
                $this->produtoModel->where('produtos.preco <', 100);
            } elseif ($preco === 'medio') {
                $this->produtoModel->where('produtos.preco >=', 100)->where('produtos.preco <=', 500);
            } elseif ($preco === 'alto') {
                $this->produtoModel->where('produtos.preco >', 500);
            }
        }


        $data = [
            'produtos' => $query->paginate(5, 'default'),
            'pager'    => $query->pager,
            'busca'    => $busca,
            'preco'    => $preco,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`usuario_id` = 1
SELECT `produtos`.*, `categorias`.`nome` as `nome_categoria`, `fotos_produtos`.`caminho` as `foto_capa`
FROM `produtos`
LEFT JOIN `categorias` ON `categorias`.`id` = `produtos`.`id_categoria`
LEFT JOIN `fotos_produtos` ON `fotos_produtos`.`produto_id` = `produtos`.`id` AND `fotos_produtos`.`capa` = 1
WHERE `produtos`.`usuario_id` = 1
ORDER BY `produtos`.`id` DESC
 LIMIT 5

    public function edit($id)
    {
        $produto = $this->produtoModel->find($id);
        $usuarioId = session()->get('usuario_id');

        if ($produto['usuario_id'] == $usuarioId) {
            $data['produto'] = $this->produtoModel->find($id);
            $data['categorias'] = $this->categoriaModel->findAll();
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '6'
SELECT *
FROM `categorias`